.metadata/.plugins/org.eclipse.core.resources/.history/c7/903af69d1fad00161ace979cc52c1157

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:whit="http://whitelist.com.br/SN/WhiteList">
   <soapenv:Header/>
   <soapenv:Body>
      <whit:ParametrosWhiteList>
         <whit:num_documento>123.456.789-09</whit:num_documento>
         <whit:dt_nascimento>2002-09-24</whit:dt_nascimento>
      </whit:ParametrosWhiteList>
   </soapenv:Body>
</soapenv:Envelope>